Repository: runcmf/runbb
Catalog: src/RunBB/lang/*/index.po
Languages: russian

source: Topics
russian: Темы

source: Empty board
russian: Форум пустой.

source: Newest user
russian: Последний зарегистрированный: %s

source: Users online
russian: Пользователей онлайн: %s

source: Guests online
russian: Гостей онлайн: %s

source: No of users
russian: Всего зарегистрированных: %s

source: No of topics
russian: Всего тем: %s

source: No of posts
russian: Всего сообщений: %s

source: Online
russian: Онлайн:

source: Board info
russian: Информация форума

source: Board stats
russian: Статистика форума

source: User info
russian: Информация пользователя
