Repository: runcmf/runbb
Catalog: src/RunBB/lang/*/install.po
Languages: russian

source: Choose install language
russian: Choose the install script language

source: Choose install language info
russian: The language used for this install script. The default language used for the board itself can be set below.

source: Already installed
russian: It seems like FeatherBB is already installed. You should go <a href="../index.php">here</a> instead.

source: You are running error
russian: You are running %1$s version %2$s. FeatherBB %3$s requires at least %1$s %4$s to run properly. You must upgrade your %1$s installation before you can continue.

source: Description
russian: Lighter than a feather.

source: Username 1
russian: Usernames must be at least 2 characters long.

source: Username 2
russian: Usernames must not be more than 25 characters long.

source: Username 3
russian: The username guest is reserved.

source: Username 4
russian: Usernames may not be in the form of an IP address.

source: Username 5
russian: Usernames may not contain all the characters ', " and [ or ] at once.

source: Username 6
russian: Usernames may not contain any of the text formatting tags (BBCode) that the forum uses.

source: Short password
russian: Passwords must be at least 6 characters long.

source: Passwords not match
russian: Passwords do not match.

source: Wrong email
russian: The administrator email address you entered is invalid.

source: No board title
russian: You must enter a board title.

source: Error default language
russian: The default language chosen doesn't seem to exist.

source: Error default style
russian: The default style chosen doesn't seem to exist.

source: No DB extensions
russian: This PHP environment does not have support for any of the databases that FeatherBB supports. PHP needs to have support for either MySQL, PostgreSQL or SQLite in order for FeatherBB to be installed.

source: Administrator username
russian: Administrator's username

source: Administrator email
russian: Administrator's email

source: Base URL
russian: The URL (without trailing slash) of your FeatherBB forum. This must be correct.

source: Required field
russian: is a required field in this form.

source: Welcome
russian: You are about to install FeatherBB. In order to install FeatherBB, you must complete the form set out below. If you encounter any difficulties with the installation, please refer to the documentation.

source: Install
russian: Install FeatherBB %s

source: Errors
russian: The following errors need to be corrected:

source: Info 1
russian: All information we need to create a connection with your database.

source: Select database
russian: Select your database type

source: Info 2
russian: Select a database. We support SQLite, MySQL and PostgreSQL.

source: Database hostname
russian: Enter your database server hostname

source: Info 3
russian: You should be able to get this info from your web host, if localhost does not work.

source: Database enter name
russian: Enter the name of your database

source: Info 4
russian: The name of the database you want to install FeatherBB on.

source: Database enter informations
russian: Enter your database username and password

source: Info 5
russian: Your MySQL username and password (ignore of SQLite).

source: Database enter prefix
russian: Enter database table prefix

source: Info 6
russian: If you want to run multiple FeatherBB installations in a single database, change this.

source: Info 7
russian: Create the very first account on your board.

source: Info 8
russian: Your username should be between 2 and 25 characters long. Your password must be at least 6 characters long. Remember that passwords are case-sensitive.

source: Info 11
russian: Settings for your board. You can change this later.

source: General information
russian: Enter your board's title and description.

source: Board description
russian: Board description (supports HTML)

source: Info 15
russian: Make your forum yours. Choose a language and a style for your board.

source: DB type not valid
russian: '%s' is not a valid database type

source: Table prefix error
russian: The table prefix '%s' contains illegal characters or is too long. The prefix may contain the letters a to z, any numbers and the underscore character. They must however not start with a number. The maximum length is 40 characters. Please choose a different prefix

source: Prefix reserved
russian: The table prefix 'sqlite_' is reserved for use by the SQLite engine. Please choose a different prefix

source: Existing table error
russian: A table called '%susers' is already present in the database '%s'. This could mean that FeatherBB is already installed or that another piece of software is installed and is occupying one or more of the table names FeatherBB requires. If you want to install multiple copies of FeatherBB in the same database, you must choose a different table prefix

source: InnoDB off
russian: InnoDB does not seem to be enabled. Please choose a database layer that does not have InnoDB support, or enable InnoDB on your MySQL server

source: Administrators
russian: Администраторы

source: Announcement
russian: Enter your announcement here.

source: Rules
russian: Enter your rules here

source: Maintenance message
russian: The forums are temporarily down for maintenance. Please try again in a few minutes.

source: Test post
russian: Test topic

source: Message
russian: You have successfully installed RunBB, congratulations! Now log in and head over to the administration control panel to configure your forum.

source: Alert cache
russian: <strong>The cache directory is currently not writable!</strong> In order for FeatherBB to function properly, the directory <em>%s</em> must be writable by PHP. Use chmod to set the appropriate directory permissions. If in doubt, chmod to 0777.

source: Alert avatar
russian: <strong>The avatar directory is currently not writable!</strong> If you want users to be able to upload their own avatar images you must see to it that the directory <em>%s</em> is writable by PHP. You can later choose to save avatar images in a different directory (see Admin/Options). Use chmod to set the appropriate directory permissions. If in doubt, chmod to 0777.

source: Alert upload
russian: <strong>File uploads appear to be disallowed on this server!</strong> If you want users to be able to upload their own avatar images you must enable the file_uploads configuration setting in PHP. Once file uploads have been enabled, avatar uploads can be enabled in Administration/Options/Features.

source: FeatherBB has been installed
russian: FeatherBB has been installed. To finalize the installation please follow the instructions below.

source: Info 17
russian: To finalize the installation, you need to click on the button below to download a file called config.php. You then need to upload this file to the root directory of your FeatherBB installation.

source: Info 18
russian: Once you have uploaded config.php, FeatherBB will be fully installed! At that point, you may <a href="../index.php">go to the forum index</a>.

source: FeatherBB fully installed
russian: FeatherBB has been fully installed! You may now <a href="../index.php">go to the forum index</a>.
