Repository: runcmf/runbb
Catalog: src/RunBB/lang/*/login.po
Languages: russian

source: Wrong user/pass
russian: Wrong username and/or password.

source: Forgotten pass
russian: Forgotten your password?

source: Login redirect
russian: Logged in successfully.

source: Logout redirect
russian: Logged out.

source: No email match
russian: There is no user registered with the email address

source: Request pass
russian: Request password

source: Request pass legend
russian: Enter the email address with which you registered

source: Request pass info
russian: A new password together with a link to activate the new password will be sent to that address.

source: Not registered
russian: Not registered yet?

source: Login legend
russian: Enter your username and password below

source: Remember me
russian: Log me in automatically each time I visit.

source: Login info
russian: If you have not registered or have forgotten your password click on the appropriate link below.

source: New password errors
russian: Password request error

source: New passworderrors info
russian: The following error needs to be corrected before a new password can be sent:

source: Forget mail
russian: An email has been sent to the specified address with instructions on how to change your password. If it does not arrive you can contact the forum administrator at

source: Email flood
russian: This account has already requested a password reset in the past hour. Please wait %s minutes before requesting a new password again.
