Repository: runcmf/runbb
Catalog: src/RunBB/lang/*/profile.po
Languages: russian

source: Section essentials
russian: Essentials

source: Section personal
russian: Personal

source: Section messaging
russian: Messaging

source: Section personality
russian: Personality

source: Section display
russian: Display

source: Section privacy
russian: Privacy

source: Section admin
russian: Administration

source: Username and pass legend
russian: Enter your username and password

source: Personal details legend
russian: Enter your personal details

source: Contact details legend
russian: Enter your messaging details

source: Paginate info
russian: Enter the number of topics and posts you wish to view on each page.

source: Pass key bad
russian: The specified password activation key was incorrect or has expired. Please re-request a new password. If that fails, contact the forum administrator at

source: Pass updated
russian: Your password has been updated. You can now login with your new password.

source: Pass updated redirect
russian: Password updated.

source: Wrong pass
russian: Wrong old password.

source: Change pass
russian: Change password

source: Change pass legend
russian: Enter and confirm your new password

source: Old pass
russian: Old password

source: New pass
russian: New password

source: Confirm new pass
russian: Confirm new password

source: Pass info
russian: Passwords must be at least 6 characters long. Passwords are case sensitive.

source: Email key bad
russian: The specified email activation key was incorrect or has expired. Please re-request change of email address. If that fails, contact the forum administrator at

source: Email updated
russian: Your email address has been updated.

source: Activate email sent
russian: An email has been sent to the specified address with instructions on how to activate the new email address. If it doesn't arrive you can contact the forum administrator at

source: Email legend
russian: Enter your new email address

source: Email instructions
russian: An email will be sent to your new address with an activation link. You must click the link in the email you receive to activate the new address.

source: Change email
russian: Change email address

source: Avatars disabled
russian: The administrator has disabled avatar support.

source: Too large ini
russian: The selected file was too large to upload. The server didn't allow the upload.

source: Partial upload
russian: The selected file was only partially uploaded. Please try again.

source: No tmp directory
russian: PHP was unable to save the uploaded file to a temporary location.

source: No file
russian: You did not select a file for upload.

source: Bad type
russian: The file you tried to upload is not of an allowed type. Allowed types are gif, jpeg and png.

source: Too wide or high
russian: The file you tried to upload is wider and/or higher than the maximum allowed

source: Too large
russian: The file you tried to upload is larger than the maximum allowed

source: Move failed
russian: The server was unable to save the uploaded file. Please contact the forum administrator at

source: Unknown failure
russian: An unknown error occurred. Please try again.

source: Avatar upload redirect
russian: Avatar uploaded.

source: Avatar deleted redirect
russian: Avatar deleted.

source: Avatar desc
russian: An avatar is a small image that will be displayed under your username in your posts. It must not be any bigger than

source: Upload avatar legend
russian: Enter an avatar file to upload

source: Forbidden title
russian: The title you entered contains a forbidden word. You must choose a different title.

source: Profile redirect
russian: Profile updated.

source: Users profile
russian: %s's profile

source: Username info
russian: Username: %s

source: Email info
russian: Email: %s

source: Posts info
russian: Posts: %s

source: Registered info
russian: Registered: %s

source: Last post info
russian: Last post: %s

source: Last visit info
russian: Last visit:

source: Show posts
russian: Show all posts

source: Show topics
russian: Show all topics

source: Show subscriptions
russian: Show all subscriptions

source: Invalid website URL
russian: The website URL you entered is invalid.

source: Website not allowed
russian: You are not allowed to add a website to your profile yet.

source: MSN
russian: Microsoft Account

source: Yahoo
russian: Yahoo! Messenger

source: Sig max size
russian: Max length: %s characters / Max lines: %s

source: Avatar legend
russian: Set your avatar display options

source: Avatar info
russian: An avatar is a small image that will be displayed with all your posts. You can upload an avatar by clicking the link below.

source: Signature legend
russian: Compose your signature

source: Signature info
russian: A signature is a small piece of text that is attached to your posts. In it, you can enter just about anything you like. Perhaps you would like to enter your favourite quote or your star sign. It's up to you! In your signature you can use BBCode if it is allowed in this particular forum. You can see the features that are allowed/enabled listed below whenever you edit your signature.

source: Sig preview
russian: Current signature preview:

source: No sig
russian: No signature currently stored in profile.

source: Signature quote/code/list/h
russian: The quote, code, list, and heading BBCodes are not allowed in signatures.

source: Topics per page
russian: Topics

source: Posts per page
russian: Posts

source: Leave blank
russian: Leave blank to use forum default.

source: Subscription legend
russian: Set your subscription options

source: Notify full
russian: Include a plain text version of new posts in subscription notification emails.

source: Auto notify full
russian: Automatically subscribe to every topic you post in.

source: Show smilies
russian: Show smilies as graphic icons.

source: Show images
russian: Show images in posts.

source: Show images sigs
russian: Show images in user signatures.

source: Show avatars
russian: Show user avatars in posts.

source: Show sigs
russian: Show user signatures.

source: Style legend
russian: Select your preferred style

source: Pagination legend
russian: Enter your pagination options

source: Post display legend
russian: Set your options for viewing posts

source: Post display info
russian: If you are on a slow connection, disabling these options, particularly showing images in posts and signatures, will make pages load faster.

source: Instructions
russian: When you update your profile, you will be redirected back to this page.

source: Group membership legend
russian: Choose user group

source: Set mods legend
russian: Set moderator access

source: Moderator in info
russian: Choose which forums this user should be allowed to moderate. Note: This only applies to moderators. Administrators always have full permissions in all forums.

source: Delete ban legend
russian: Delete (administrators only) or ban user

source: Confirm delete legend
russian: Important: read before deleting user

source: Confirmation info
russian: Please confirm that you want to delete the user

source: Delete warning
russian: Warning! Deleted users and/or posts cannot be restored. If you choose not to delete the posts made by this user, the posts can only be deleted manually at a later time.

source: Delete posts
russian: Delete any posts and topics this user has made.

source: Delete
russian: Удалить

source: User delete redirect
russian: User deleted.

source: User promote redirect
russian: User promoted.

source: Group membership redirect
russian: Group membership saved.

source: Update forums redirect
russian: Forum moderator rights updated.

source: Ban redirect
russian: Redirecting …

source: No delete admin message
russian: Админ не может быть удален. Для удаления перевидите его в другую группу.
