Repository: runcmf/runbb
Catalog: src/RunBB/lang/*/search.po
Languages: russian

source: No search permission
russian: You do not have permission to use the search feature.

source: Search flood
russian: At least %s seconds have to pass between searches. Please wait %s seconds and try searching again.

source: Search criteria legend
russian: Enter your search criteria

source: Search info
russian: To search by keyword, enter a term or terms to search for. Separate terms with spaces. Use AND, OR and NOT to refine your search. To search by author enter the username of the author whose posts you wish to search for. Use wildcard character * for partial matches.

source: Search in legend
russian: Select where to search

source: Search in info
russian: Choose in which forum you would like to search and if you want to search in topic subjects, message text or both.

source: Search multiple forums info
russian: If no forums are selected, all forums will be searched.

source: Forum search
russian: Forum

source: Message and subject
russian: Message text and topic subject

source: Message only
russian: Message text only

source: Topic only
russian: Topic subject only

source: Search results legend
russian: Select how to view search results

source: Search results info
russian: You can choose how you wish to sort and show your results.

source: Sort by post time
russian: Post time

source: Sort by author
russian: Author

source: Sort by subject
russian: Subject

source: Sort by forum
russian: Forum

source: Show as
russian: Show results as

source: Show as topics
russian: Topics

source: Show as posts
russian: Posts

source: Quick search show_new
russian: New

source: Quick search show_recent
russian: Active

source: Quick search show_unanswered
russian: Unanswered

source: Quick search show_replies
russian: Posted

source: Quick search show_user_topics
russian: Topics by %s

source: Quick search show_user_posts
russian: Posts by %s

source: Quick search show_subscriptions
russian: Subscribed by %s

source: By keywords show as topics
russian: Topics with posts containing '%s'

source: By keywords show as posts
russian: Posts containing '%s'

source: By user show as topics
russian: Topics with posts by %s

source: By user show as posts
russian: Posts by %s

source: By both show as topics
russian: Topics with posts containing '%s', by %s

source: By both show as posts
russian: Posts containing '%s', by %s

source: No terms
russian: You have to enter at least one keyword and/or an author to search for.

source: No hits
russian: Your search returned no hits.

source: No user posts
russian: There are no posts by this user in this forum.

source: No user topics
russian: There are no topics by this user in this forum.

source: No subscriptions
russian: This user is currently not subscribed to any topics.

source: No new posts
russian: There are no topics with new posts since your last visit.

source: No recent posts
russian: No new posts have been made within the last 24 hours.

source: No unanswered
russian: There are no unanswered posts in this forum.
